Revit 2026 API

# DocumentNewOpening(Wall, XYZ, XYZ) Method

---

Creates a rectangular opening on a wall.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Opening NewOpening(
	Wall wall,
	XYZ pntStart,
	XYZ pntEnd
)
```
```vb
Public Function NewOpening (
	wall As Wall,
	pntStart As XYZ,
	pntEnd As XYZ
) As Opening
```
```cpp
public:
Opening^ NewOpening(
	Wall^ wall,
	XYZ^ pntStart,
	XYZ^ pntEnd
)
```
```fsharp
member NewOpening :
        wall : Wall *
        pntStart : XYZ *
        pntEnd : XYZ -> Opening
```

#### Parameters

wall Wall
     Host element of the opening.
pntStart XYZ
    One corner of the rectangle.
pntEnd XYZ
    The opposite corner of the rectangle.

#### Return Value

Opening If successful, an Opening object is returned.

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown if the wall does not exist in the given document, or if the wall doesn't support rectangular openings. |

Slanted stacked walls do not support rectangular openings.

#### Reference

Document Class

NewOpening Overload

Autodesk.Revit.Creation Namespace